# main.py
INVITE_TO_GROUP = 'Привет! Чтобы пользоваться ботом в беседе - нужно дать мне права администратора.'

# command.py
HELP_MSG = '\n📜 пары [группа/преподаватель] - выводит какие пары сегодня у [группы/преподаватель].' \
               '\nПример: пары са-16' \
               '\n📜 пары на неделю [группа] - выводит какие пары у [группы] за неделю.' \
               '\nПример: пары на неделю са-16' \
               '\n⏰ звонки - выводит расписание звонков.' \
               '\n\n👤 фио [Фамилия препода] - поиск по фамиили преподавателей.' \
               '\nПример: фио Шалков' \
               '\n\n📌 моя группа [группа] - отправляет клавиатуру с командами для [группа].' \
               '\nПример: моя группа са-16' \
               '\n🚫 убери клавиатуру - убирает клавиатуру вызванную командой "моя группа"' \
               '\n\n🔔 уведомления для [группа] - отправляет уведомления для [группа].' \
               '\nПример: уведомления для са-16' \
               '\n🔕 отписаться - отписаться от всех уведомлений.' \
               '\n📣 отображать меня - включает/выключает отображение в глобальном поиске по группам (см. контакты группы).' \
               '\n✒ регистрация - повторно пройти этапы регистрации.' \
               '\n\n🔎 ссылка на [фамилия] - берет ссылку на онлайн кабинет преподователя [фамилия].' \
               '\n\n📱 контакты группы [группа] - отображает подписчиков группы у которых включена видимость.'

CALLS_SCHEDULE = "&#10004; ОБЫЧНОЕ РАСПИСАНИЕ" \
              "\n1&#8419; 08:00 — 09:30" \
              "\n2&#8419; 09:40 — 11:10" \
              "\n3&#8419; 11:30 — 13:00" \
              "\n4&#8419; 13:10 — 14:40" \
              "\n5&#8419; 15:00 — 16:30" \
              "\n6&#8419; 16:40 — 18:10" \
              "\n7&#8419; 18:20 — 19:50" \
              "\n" \
              "\n&#128204; РАСПИСАНИЕ С КЛ. ЧАСОМ" \
              "\n1&#8419; 08:00 — 09:30" \
              "\n2&#8419; 09:40 — 11:10" \
              "\n3&#8419; 11:30 — 13:00" \
              "\n&#10071; 13:10 — 13:55" \
              "\n4&#8419; 14:00 — 15:30" \
              "\n5&#8419; 15:40 — 17:10" \
              "\n6&#8419; 17:20 — 18:50" \
              "\n" \
              "\n&#128197; СОКРАЩЕННОЕ РАСПИСАНИЕ" \
              "\n1&#8419; 08:00 — 08:50" \
              "\n2&#8419; 09:00 — 09:50" \
              "\n3&#8419; 10:00 — 10:50" \
              "\n4&#8419; 11:00 — 11:50" \
              "\n5&#8419; 12:00 — 12:50" \
              "\n6&#8419; 13:00 — 13:50" \
              "\n7&#8419; 14:00 — 14:50"
